"""
Напишите программу печатающую бейджики учеников.
Программа запрашивает ввод числа учеников и печатает каждому бейджик. Бейдж содержит название учебного заведения:
«Колледж Сириус», поле для имени:
«Имя: ____» и поле для школы:
«Группа: ____». Напиши программу, печатающую бейджики студентов как на картинке. В завершении программа должна печатать:
«Готово! Заберите бейджики.»
Функция должна принимать имя и группу ученика.
"""

def badge (name, group):
    print("College Sirius")
    print("Name", name)
    print("Group:", group)
    print("Done! Get your badges")

name = input("Введите имя:")
group = input("Введите группу:")

badge(name, group)
    